---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.KeyBasedTreeEntryFailures.MissingParent
source: html/02dbbb85-7a6c-0231-0ce0-82040fa643bb.htm
---
# Autodesk.Revit.DB.BuiltInFailures.KeyBasedTreeEntryFailures.MissingParent Property

No parent [EntryType] '[Code]' for '[Code]'

## Syntax (C#)
```csharp
public static FailureDefinitionId MissingParent { get; }
```